package com.lin.MyTest.util;

import com.github.stuxuhai.jpinyin.PinyinException;
import com.github.stuxuhai.jpinyin.PinyinFormat;
import com.github.stuxuhai.jpinyin.PinyinHelper;
import org.slf4j.Logger;
import org.slf4j.LoggerFactory;

public class PinyinUtil {

    private static final Logger logger = LoggerFactory.getLogger(PinyinUtil.class);

    public static String getPinyin(String s) {
        try {
            return PinyinHelper.convertToPinyinString(s, "", PinyinFormat.WITHOUT_TONE);
        } catch (PinyinException e) {
            logger.error("pinyin convert error, " + s, e);
        }
        return "";
    }

    public static String getFirstCharacter(String s) {
        String pinyin = "";
        String result = "";
        try {
            pinyin = PinyinHelper.convertToPinyinString(s, " ", PinyinFormat.WITHOUT_TONE);
        } catch (PinyinException e) {
            logger.error("pinyin convert error, " + s, e);
        }
        String[] split = pinyin.split(" ");
        for (String str : split) {
            if (str.length() > 0) {
                result += str.substring(0, 1);
            }
        }
        return result;
    }

    public static void main(String[] args) {
        String a = "台湾\t3fdfb490b1\t\n" +
                "包含 台湾省地区的用户\n" +
                "2017-11-20 14:02\t\n" +
                "澳门\tdc01941137\t\n" +
                "包含 澳门特别行政区地区的用户\n" +
                "2017-11-20 14:02\t\n" +
                "香港\tf9988f0319\t\n" +
                "包含 香港特别行政区地区的用户\n" +
                "2017-11-20 14:02\t\n" +
                "阿勒泰地区\t74cdc4775b\t\n" +
                "包含 阿勒泰地区地区的用户\n" +
                "2017-11-20 14:02\t\n" +
                "塔城地区\ta5f910c65f\t\n" +
                "包含 塔城地区地区的用户\n" +
                "2017-11-20 14:01\t\n" +
                "伊犁哈萨克自治州\taea5a623ca\t\n" +
                "包含 伊犁哈萨克自治州地区的用户\n" +
                "2017-11-20 14:00\t\n" +
                "和田地区\t2c2e26262e\t\n" +
                "包含 和田地区地区的用户\n" +
                "2017-11-20 13:59\t\n" +
                "喀什地区\t3cc4d34e5b\t\n" +
                "包含 喀什地区地区的用户\n" +
                "2017-11-20 13:59\t\n" +
                "克孜勒苏柯尔克孜自治州\tf3bbd0495c\t\n" +
                "包含 克孜勒苏柯尔克孜自治州地区的用户\n" +
                "2017-11-20 13:59\t\n" +
                "阿克苏地区\t25e1495462\t\n" +
                "包含 阿克苏地区地区的用户\n" +
                "2017-11-20 13:59\t\n" +
                "巴音郭楞蒙古自治州\t552d07a215\t\n" +
                "包含 巴音郭楞蒙古自治州地区的用户\n" +
                "2017-11-20 13:59\t\n" +
                "博尔塔拉蒙古自治州\t2a5aaf45c8\t\n" +
                "包含 博尔塔拉蒙古自治州地区的用户\n" +
                "2017-11-20 13:59\t\n" +
                "昌吉回族自治州\t741b390881\t\n" +
                "包含 昌吉回族自治州地区的用户\n" +
                "2017-11-20 13:58\t\n" +
                "哈密\t8c45c7fa93\t\n" +
                "包含 哈密地区地区的用户\n" +
                "2017-11-20 13:58\t\n" +
                "吐鲁番\teac9e1a080\t\n" +
                "包含 吐鲁番地区地区的用户\n" +
                "2017-11-20 13:58\t\n" +
                "克拉玛依\t017159b7c2\t\n" +
                "包含 克拉玛依市地区的用户\n" +
                "2017-11-20 13:58\t\n" +
                "中卫\t97d49a340c\t\n" +
                "包含 中卫市地区的用户\n" +
                "2017-11-20 13:58\t\n" +
                "固原\t9c3f8357bb\t\n" +
                "包含 固原市地区的用户\n" +
                "2017-11-20 13:58\t\n" +
                "吴忠\tee3baaf1e5\t\n" +
                "包含 吴忠市地区的用户\n" +
                "2017-11-20 13:57\t\n" +
                "石嘴山\t75e4205c23\t\n" +
                "包含 石嘴山市地区的用户\n" +
                "2017-11-20 13:57\t\n" +
                "海西蒙古族藏族自治州\tb86d753be5\t\n" +
                "包含 海西蒙古族藏族自治州地区的用户\n" +
                "2017-11-20 13:57\t\n" +
                "玉树藏族自治州\td7199913c8\t\n" +
                "包含 玉树藏族自治州地区的用户\n" +
                "2017-11-20 13:57\t\n" +
                "果洛藏族自治州\td7914585ef\t\n" +
                "包含 果洛藏族自治州地区的用户\n" +
                "2017-11-20 13:56\t\n" +
                "海南藏族自治州\td0e0f20fc8\t\n" +
                "包含 海南藏族自治州地区的用户\n" +
                "2017-11-20 13:55\t\n" +
                "黄南藏族自治州\tc8d731568c\t\n" +
                "包含 黄南藏族自治州地区的用户\n" +
                "2017-11-20 13:55\t\n" +
                "海北藏族自治州\tb9672243b7\t\n" +
                "包含 海北藏族自治州地区的用户\n" +
                "2017-11-20 13:54\t\n" +
                "甘南藏族自治州\t2dd13815d3\t\n" +
                "包含 甘南藏族自治州地区的用户\n" +
                "2017-11-20 13:54\t\n" +
                "临夏回族自治州\t44c40d61ce\t\n" +
                "包含 临夏回族自治州地区的用户\n" +
                "2017-11-20 13:54\t\n" +
                "陇南\t96f873ad0d\t\n" +
                "包含 陇南市地区的用户\n" +
                "2017-11-20 13:54\t\n" +
                "定西\td14fa78665\t\n" +
                "包含 定西市地区的用户\n" +
                "2017-11-20 13:54\t\n" +
                "庆阳\t5157fa8aac\t\n" +
                "包含 庆阳市地区的用户\n" +
                "2017-11-20 13:53\t\n" +
                "酒泉\t96223a96f1\t\n" +
                "包含 酒泉市地区的用户\n" +
                "2017-11-20 13:53\t\n" +
                "平凉\t69f1293155\t\n" +
                "包含 平凉市地区的用户\n" +
                "2017-11-20 13:53\t\n" +
                "白银\t79a275921e\t\n" +
                "包含 白银市地区的用户\n" +
                "2017-11-20 13:53\t\n" +
                "金昌\t131c37ce3d\t\n" +
                "包含 金昌市地区的用户\n" +
                "2017-11-20 13:53\t\n" +
                "商洛\t1dc29ad983\t\n" +
                "包含 商洛市地区的用户\n" +
                "2017-11-20 13:53\t\n" +
                "安康\tfa5190725a\t\n" +
                "包含 安康市地区的用户\n" +
                "2017-11-20 13:52\t\n" +
                "铜川\t0a8a9f17a4\t\n" +
                "包含 铜川市地区的用户\n" +
                "2017-11-20 13:52\t\n" +
                "阿里地区\t823fd64887\t\n" +
                "包含 阿里地区地区的用户\n" +
                "2017-11-20 13:52\t\n" +
                "那曲地区\tad179e6dc5\t\n" +
                "包含 那曲地区地区的用户\n" +
                "2017-11-20 13:52\t\n" +
                "迪庆藏族自治州\t4dd8dd9632\t\n" +
                "包含 迪庆藏族自治州地区的用户\n" +
                "2017-11-20 13:52\t\n" +
                "怒江傈僳族自治州\t63af6aa52d\t\n" +
                "包含 怒江傈僳族自治州地区的用户\n" +
                "2017-11-20 13:52\t\n" +
                "德宏傣族景颇族自治州\tfa8b0a7f16\t\n" +
                "包含 德宏傣族景颇族自治州地区的用户\n" +
                "2017-11-20 13:51\t\n" +
                "文山壮族苗族自治州\tdca4b136c7\t\n" +
                "包含 文山壮族苗族自治州地区的用户\n" +
                "2017-11-20 13:51\t\n" +
                "红河哈尼族彝族自治州\t0c677e3c8a\t\n" +
                "包含 红河哈尼族彝族自治州地区的用户\n" +
                "2017-11-20 13:51\t\n" +
                "楚雄彝族自治州\t946ec09ba3\t\n" +
                "包含 楚雄彝族自治州地区的用户\n" +
                "2017-11-20 13:51\t\n" +
                "黔南布依族苗族自治州\t560c8d9512\t\n" +
                "包含 黔南布依族苗族自治州地区的用户\n" +
                "2017-11-20 13:50\t\n" +
                "黔东南苗族侗族自治州\t0d7b89aa12\t\n" +
                "包含 黔东南苗族侗族自治州地区的用户\n" +
                "2017-11-20 13:50\t\n" +
                "黔西南布依族苗族自治州\t08c24003c9\t\n" +
                "包含 黔西南布依族苗族自治州地区的用户\n" +
                "2017-11-20 13:50\t\n" +
                "凉山彝族自治州\t7e851fccbf\t\n" +
                "包含 凉山彝族自治州地区的用户\n" +
                "2017-11-20 13:50\n" +
                "甘孜藏族自治州\t53821ac29f\t\n" +
                "包含 甘孜藏族自治州地区的用户\n" +
                "2017-11-20 13:49\t\n" +
                "阿坝藏族羌族自治州\t5ea7e0661d\t\n" +
                "包含 阿坝藏族羌族自治州地区的用户\n" +
                "2017-11-20 13:49\t\n" +
                "巴中\tc0b9a4f3cc\t\n" +
                "包含 巴中市地区的用户\n" +
                "2017-11-20 13:49\t\n" +
                "眉山\t4ff4053893\t\n" +
                "包含 眉山市地区的用户\n" +
                "2017-11-20 13:49\t\n" +
                "内江\teb18840489\t\n" +
                "包含 内江市地区的用户\n" +
                "2017-11-20 13:49\t\n" +
                "湘西土家族苗族自治州\t7be6eaf242\t\n" +
                "包含 湘西土家族苗族自治州地区的用户\n" +
                "2017-11-20 13:48\t\n" +
                "新余\t62e36ea894\t\n" +
                "包含 新余市地区的用户\n" +
                "2017-11-20 13:48\t\n" +
                "萍乡\t4a710c1e30\t\n" +
                "包含 萍乡市地区的用户\n" +
                "2017-11-20 13:48\t\n" +
                "丽水\t5f2edf2e90\t\n" +
                "包含 丽水市地区的用户\n" +
                "2017-11-20 13:48\t\n" +
                "衢州\t50f03b1d9d\t\n" +
                "包含 衢州市地区的用户\n" +
                "2017-11-20 13:48\t\n" +
                "大兴安岭地区\td303cd57d8\t\n" +
                "包含 大兴安岭地区地区的用户\n" +
                "2017-11-20 13:47\t\n" +
                "七台河\tded789e9a5\t\n" +
                "包含 七台河市地区的用户\n" +
                "2017-11-20 13:47\t\n" +
                "伊春\tc8ef9d8128\t\n" +
                "包含 伊春市地区的用户\n" +
                "2017-11-20 13:47\t\n" +
                "鹤岗\te4d31de500\t\n" +
                "包含 鹤岗市地区的用户\n" +
                "2017-11-20 13:47\t\n" +
                "延边朝鲜族自治州\t01db59de23\t\n" +
                "包含 延边朝鲜族自治州地区的用户\n" +
                "2017-11-20 13:47\t\n" +
                "白城\t28fa2b0100\t\n" +
                "包含 白城市地区的用户\n" +
                "2017-11-20 13:46\t\n" +
                "松原\td2f0a87d7c\t\n" +
                "包含 松原市地区的用户\n" +
                "2017-11-20 13:46\t\n" +
                "白山\td8fea0252e\t\n" +
                "包含 白山市地区的用户\n" +
                "2017-11-20 13:46\t\n" +
                "通化\tec59c91fba\t\n" +
                "包含 通化市地区的用户\n" +
                "2017-11-20 13:46\t\n" +
                "辽源\t719dd996d5\t\n" +
                "包含 辽源市地区的用户\n" +
                "2017-11-20 13:46\t\n" +
                "四平\tc299caf6c3\t\n" +
                "包含 四平市地区的用户\n" +
                "2017-11-20 13:45\t\n" +
                "阿拉善盟\t973acbd235\t\n" +
                "包含 阿拉善盟地区的用户\n" +
                "2017-11-20 13:44\t\n" +
                "锡林郭勒盟\tdd515af9f4\t\n" +
                "包含 锡林郭勒盟地区的用户\n" +
                "2017-11-20 13:44\t\n" +
                "兴安盟\te44a1d496e\t\n" +
                "包含 兴安盟地区的用户\n" +
                "2017-11-20 13:44\t\n" +
                "吕梁\t93538f4a1c\t\n" +
                "包含 吕梁市地区的用户\n" +
                "2017-11-20 13:44\t\n" +
                "忻州\t4661488efb\t\n" +
                "包含 忻州市地区的用户\n" +
                "2017-11-20 13:43\t\n" +
                "朔州\t5edf7acec9\t\n" +
                "包含 朔州市地区的用户\n" +
                "2017-11-20 13:43\t\n" +
                "晋城\te7c71aedde\t\n" +
                "包含 晋城市地区的用户\n" +
                "2017-11-20 13:43\t\n" +
                "阳泉\t0e435d853d\t\n" +
                "包含 阳泉市地区的用户\n" +
                "2017-11-20 13:43";
        String[] array = a.split("\n");
        String[] array2;
        for(int i=0; i< array.length; i++) {
            if(i%3 == 0) {
                String str = array[i];
                array2 = str.split("\t");
                System.out.println("update `city_app` set `segment_id` = '"+array2[1]+"' where `city_name` = '"+array2[0]+"';");
            }
        }
    }
}
